Revit 2024 API
SpatialElementTag.IsTaggingLink Property
 Identifies if the tag has reference to a spatial element in a linked document or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public bool IsTaggingLink { get; }
Visual Basic
Public ReadOnly Property IsTaggingLink As Boolean
	Get
Visual C++
public:
property bool IsTaggingLink {
	bool get ();
}
See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace